{
  "applications": [
    {
      "id": "0100b1c01f024000"
    }
  ],
  "cloud_backup_type": "supported",
  "consumables": [],
  "content_type": "title",
  "copyright_text": "Copyright Childish Things Limited. All rights reserved. Distributed by Childish Things Limited. The Childish Things logo is the [registered] trademark of Childish Things Limited.",
  "courses": [],
  "demos": [],
  "description": "Build your own dream team in Cricket Captain 2024. \nThe 20 Over World Cup takes centre stage at the start of the 2024 season and, with our Score Predictor making its debut, you can manage run chases and set targets with a clear indication of expectations for the match conditions. With feedback from last year’s game, and simulating thousands of matches from every situation, we have rebalanced scoring rates across the board, with focus on both First Class and limited over scoring rates and AI. Daniel Norcross brings his inimitable style to the commentary box this year, for the first time on Cricket Captain.  \nCricket Captain 2024 expands our database once again, including honours boards showing every international century and five-wicket hall across all formats at every ground. With improved filters and viewing options for the vast array of statistics accessible through the game, picking your squads and accessing records is more intuitive and responsive. \nAll domestic systems have been updated to include the latest developments in Pakistan, West Indies and around the world. \nKey features for 2024 include:\n    • Commentary: new commentary from Daniel Norcross.\n    • Score Predictor: in-match score and win predictor.\n    • Honours Boards: every international 5 wicket haul or century, in all 3 match types.\n    • Match Engine: improved following user feedback and simulations.\n    • Winter Coaching: coach your team outside of the playing season.\n    • Updated International Team Rankings: calculated from last 4 years results.\n    • New Kits: updated international kits.\n    • International Player Rankings: updated with historical data.\n    • Asia Trophy: play in ODI and 20 Over International tournaments.\n    • Updated Pakistan Domestic System:  Eight new teams.\n    • Domestic System Updates: all systems updated to latest rules and formats.\n    • Improved Player Generation: rebalanced with focus on player aggression. \n    • Test Championship: updated for the 2024 season.\n    • Tournament Modes: play in stand-alone One Day, Asia Trophy or 20 Over World Cups. Create your own World XIs, All-Time Great and Custom Match Series.\n    • Interface: improved screen layout.\nComplete Stats Update for the 2024 Season:\n    • Updated player database with over 7,500 players.\n    • Updated historical keeper and outfield stats.\n    • Updated versus, ground and team records with partnerships, bowling and batting records.\n    • Updated domestic squads for all 146 playable domestic teams.\n    • Updated recent series stats for all players.\n    • Updated real world player form for Domestic and International",
  "disclaimer": "All trademarks are the property of their respective owners. Childish Things Limited makes no warranty or representation in respect of any trademark. In particular Childish Things does not make any warranty or representation in relation to the names contained within this software product including without limitation the name of any player, stadium, competition, organisation or association (\"Real World Data\") all trademarks relating to which are the property of their respective owners. Real World Data is used descriptively and solely for the purposes of information regarding the sport of cricket and all such use is intended to be descriptive and incidental to the use of this software product.\n\nNo player, club, competition, association or organisation endorses or is associated or connected with this software product in any way and Childish Things make no representation of any such endorsement, association or connection.\n\nNo image or likeness of any player, club, competition, association or organisation is used in this site and any similarity with any graphical element of this site is co-incidental.\n\nAll statistics contained within the Real World Data are researched or computer generated and intended to be fair. They are not intended to be and should not be relied upon or considered a true reflection of the abilities or performances of any individual player, club or competition but a computerised interpretation of data given to it or generated by it.\n\nIn the event that any player, club, association, competition or organisation objects to its, his or her inclusion in this site as Real World Data or the content of any Real World Data they should notify us by email via the support page whereupon Childish Things shall act appropriately in connection with legitimate concerns.\n\nNotwithstanding the foregoing, Childish Things have used reasonable efforts to ensure compliance with all applicable laws and regulations.\n\nThis game is not endorsed by any sporting organisation, competition, club, stadium or player.",
  "ex_membership_free": false,
  "features": [],
  "formal_name": "Cricket Captain 2024",
  "genre": "Sports / Simulation / Strategy",
  "has_aoc": false,
  "hero_banner_url": "https://img-eshop.cdn.nintendo.net/i/4841537b26461697e962dc06e5998b86f489922cc13177a60a209040b8f928c0.jpg",
  "id": 70010000080784,
  "in_app_purchase": false,
  "included_bundles": [],
  "included_pretickets": [],
  "included_pt_right_ids": [],
  "is_new": false,
  "is_special_trial": false,
  "languages": [
    {
      "iso_code": "en",
      "name": "English"
    }
  ],
  "label_platform": "HAC",
  "membership_required": false,
  "movies": [],
  "network_feature_description": "This software supports the following:\n- Touch screen",
  "notices": [],
  "platform": {
    "id": 2001,
    "name": "Nintendo Switch"
  },
  "play_styles": [
    {
      "id": 60,
      "name": "TV_MODE"
    },
    {
      "id": 61,
      "name": "TABLETOP_MODE"
    },
    {
      "id": 62,
      "name": "HANDHELD_MODE"
    }
  ],
  "player_number": {
    "offline_max": 1,
    "offline_min": 1
  },
  "public_status": "public",
  "publisher": {
    "id": 3625,
    "name": "Childish Things"
  },
  "rating_info": {
    "content_descriptors": [
      {
        "id": 14,
        "name": "Online Interactivity",
        "type": "descriptor"
      },
      {
        "id": 143,
        "name": "Users Interact",
        "type": "descriptor"
      }
    ],
    "rating": {
      "age": 0,
      "id": 1,
      "image_url": "https://img-eshop.cdn.nintendo.net/i/3f8e50837c6187177bacc91f13b99eea5a4426daa6c8301ff5a07f45b8260883.jpg",
      "name": "G",
      "provisional": false,
      "svg_image_url": "https://img-eshop.cdn.nintendo.net/i/fe8db0a9c24a563d55a842178a06784ca5d8d615afaf18bec48c6a74f5396245.svg"
    },
    "rating_system": {
      "id": 308,
      "name": "COB"
    }
  },
  "release_date_on_eshop": "2024-07-18",
  "rom_size_infos": [
    {
      "platform": "HAC",
      "total_rom_size": 929038336,
      "estimated_rom_size": 629145600
    },
    {
      "platform": "BEE",
      "total_rom_size": 929038336
    }
  ],
  "screenshots": [
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/ede831a79a9808eb4bd2d0f2326397598ac830e455a3a41746c4cb85f85b5769.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/acea05ea12b84229a36345c0b4ec149fb86bb342aa2c5a2b79cde75df783846e.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/96cb5081b9d10f4b12bb43537aca77fa53ba9a17401180f02d4221967e7b68b4.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/c1f18fa780146aa1253b2281ab6c4d376dd7157056a1b749f22d721e08b7535e.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/6653d5bdeccb33b6b3f82d02ddb4ef1efb5e1bd24514b25942463ce86760fba2.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/d1a7a1027125acee9ed7c0b74d9482b2386d6172b4d6dc6d6d9eb0d7966e1220.jpg"
        }
      ]
    }
  ],
  "target_titles": [],
  "rights": [
    {
      "title_id": "0100b1c01f024000",
      "new_key021": true,
      "new_key022": true
    }
  ],
  "tags": [
    {
      "sub_category": {
        "name": "Sports",
        "category_id": "1"
      }
    }
  ],
  "dominant_colors": [
    "f9fafa",
    "034327",
    "6b7926"
  ],
  "supported_features": {
    "game_share_online": false,
    "game_share_local": false,
    "game_chat_link": false
  }
}