{
  "applications": [
    {
      "id": "040076e025b46000"
    }
  ],
  "catch_copy": "Set a course... for home.",
  "cloud_backup_type": "supported",
  "consumables": [],
  "content_type": "title",
  "copyright_text": "© 2026 Daedalic Entertainment GmbH and gameXcite GmbH. The Daedalic logo is a trademark of Daedalic Entertainment GmbH, Germany. TM & © 2026 CBS Studios Inc. Star Trek and related marks and logos are trademarks of CBS Studios Inc. All Rights Reserved.",
  "courses": [],
  "demos": [],
  "description": "Star Trek: Voyager - Across the Unknown is a story-driven survival strategy game in which the fate of the iconic starship is in your hands. Take the helm, manage the ship and resources, and make difficult decisions. Will you be able to bring home the ship and its crew?\n\n“What if?” Scenarios\nDid you ever wonder what would have happened had Captain Janeway decided differently? If an important crew member had followed a different path? Or what the outcome would have been had the crew of the U.S.S. Voyager embraced Borg technology to increase their chances of survival?\n\nWonder no more: Star Trek: Voyager - Across the Unknown allows players to take control and shape the journey of the U.S.S. Voyager as they want. Take a risky approach or play it safe. Be diplomatic or let phasers do the talking. Research technologies that were shunned by the crew. But: Be prepared to deal with the consequences of your actions! Each run you will encounter different situations and even iconic characters might meet an early end if you don’t react accordingly.\n\nDeep Ship Management and Research\nAfter being moved forcefully into the Delta Quadrant, the U.S.S. Voyager ends up heavily damaged and in dire need of repairs as well as internal reconstruction. Restore destroyed rooms, secure life support and energy supplies, and start constructing. Ship systems, crew quarters, industrial and research facilities: You must decide what to build and when, to ensure the ship has what it needs for the perilous journey.\n\nExpedite research into different fields. New technologies and improved layouts will not only strengthen the ship but also boost your crew’s morale. Exotic and dangerous research, like the technology of the Borg, is also within your reach. As captain, will you embrace it for the potential it offers, or will you omit it for the dangers it presents?\n\nExploration and Resource Acquisition\nThe dangers and opportunities of the Delta Quadrant beckon to be discovered by you and your crew. Scan celestial bodies to locate precious resources that fuel your journey. Find points of interest and oddities along your way, but beware: While the Delta Quadrant may reward the bold, it punishes the careless just as quickly. As captain, you have the final say in plotting a course and defining an approach.\n\nShip Combat and Away Missions\nThe journey of the U.S.S. Voyager would not be possible without both combat between ships and away missions to planets or space facilities.\n\nFor away missions, put together a team based on the individual talents of your crew. A team with skills that complement each other might be best suited for the task, but it is up to you to call the shots. Minimize the risk for the team’s members, rush headlong into danger, or take a scientific approach - you decide.\n\nWhen diplomacy fails, the U.S.S. Voyager and its crew are ready to enter ship combat at your command. From the bridge, you give commands for offensive and defensive maneuvers, targeting enemy ship systems and using special weaponry. And even during ship combat, the individual skills of your crew members come into play: Assign battle stations to crew who bring precious skills to the table and trigger them in crucial moments to maximize your combat effectiveness.",
  "ex_membership_free": false,
  "features": [],
  "formal_name": "Star Trek: Voyager - Across the Unknown",
  "genre": "Strategy",
  "has_aoc": true,
  "hero_banner_url": "https://img-eshop.cdn.nintendo.net/i/01741b5ebc547b23a6bdab3582f1cbbf4bdd9b3954432f281fc694607ae978d7.jpg",
  "id": 70010000108173,
  "in_app_purchase": false,
  "included_bundles": [
    {
      "id": 70070000033047
    }
  ],
  "included_pretickets": [],
  "included_pt_right_ids": [],
  "is_new": false,
  "is_special_trial": false,
  "languages": [
    {
      "iso_code": "en",
      "name": "English"
    }
  ],
  "label_platform": "BEE",
  "membership_required": false,
  "movies": [],
  "notices": [],
  "platform": {
    "id": 3001,
    "name": "Nintendo Switch 2"
  },
  "play_styles": [
    {
      "id": 60,
      "name": "TV_MODE"
    },
    {
      "id": 61,
      "name": "TABLETOP_MODE"
    },
    {
      "id": 62,
      "name": "HANDHELD_MODE"
    }
  ],
  "player_number": {
    "offline_max": 1,
    "offline_min": 1
  },
  "public_status": "public",
  "publisher": {
    "id": 1758,
    "name": "Daedalic Entertainment"
  },
  "rating_info": {
    "content_descriptors": [
      {
        "id": 67,
        "name": "Mild Violence",
        "type": "descriptor"
      }
    ],
    "rating": {
      "age": 8,
      "id": 2,
      "image_url": "https://img-eshop.cdn.nintendo.net/i/7af638bfc81b793c730659f8c9a30b867fa62dfe9aec8659c8f68e8d86bdb7c1.jpg",
      "name": "PG",
      "provisional": false,
      "svg_image_url": "https://img-eshop.cdn.nintendo.net/i/5870c8a3788fb791ec24f55afffcd78dd8c66e382e01befd6a76e90aee350996.svg"
    },
    "rating_system": {
      "id": 309,
      "name": "OFLC"
    }
  },
  "release_date_on_eshop": "2026-02-19",
  "rom_size_infos": [
    {
      "platform": "HAC"
    },
    {
      "platform": "BEE",
      "total_rom_size": 9525264384,
      "estimated_rom_size": 9525264384
    }
  ],
  "screenshots": [
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/de3760c63b9be4c85ad326e34d7f4e9068994bd3aceebcc1780a5ad896a52b95.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/e19a692c4af084413e75f7352797bc6e5421c492ff068ed7ee41e34ae2c053bc.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/88ee50d55758d678ed65f4d8493dad0664f84bd3b3b7d5b9d57584fc5251b0f0.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/4983edf506f55a213f6c03a238717ef0aeaf1dac7433a0a42530a36221a0db8f.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/7093c4c196313f758c71863f282421df0d937ae0d2d702ccd26471e70c9ebca0.jpg"
        }
      ]
    },
    {
      "images": [
        {
          "url": "https://img-eshop.cdn.nintendo.net/i/1373122071ee85cfae60af3817fe75dda6b251807155a4ae481f6b51e729923c.jpg"
        }
      ]
    }
  ],
  "target_titles": [],
  "rights": [
    {
      "title_id": "040076e025b46000",
      "new_key021": true,
      "new_key022": true
    }
  ],
  "tags": [],
  "dominant_colors": [
    "19242c",
    "e9efef",
    "a7b0af"
  ],
  "supported_features": {
    "game_share_online": false,
    "game_share_local": false,
    "game_chat_link": false
  }
}